In [19]:
import pandas as pd
import seaborn as sns

#### Init

In [262]:
df = pd.DataFrame()
df['user']=['Ирина','Дмитрий','Алексей']
df['account_name']=['@IrinaYurasova','@format837','@format37']
df['account_id']=['38470768','70753233','106129214']
df['посуда']=[0,1,0]
df['мусор']=[1,1,0]
df['туалет']=[1,0,1]

In [263]:
df.to_csv('data.csv',index = None)

#### Stats

In [281]:
df_full = pd.read_csv('data.csv')
df = pd.DataFrame()
df['user']=df_full['user']
df['Посуда']=df_full['посуда']
df['Мусор']=df_full['мусор']
df['Туалет']=df_full['туалет']
df = df.set_index('user')
#heat_map = sns.heatmap(df, annot=True, cmap="YlGnBu")
heat_map = sns.heatmap(df, annot=True, cmap="YlGnBu", cbar = False)
fig = heat_map.get_figure()
fig.clf()
fig = heat_map.get_figure()
fig.savefig("heat_map.png")

In [278]:
#heat_map = sns.heatmap(df, annot=True, cmap="YlGnBu")
fig = heat_map.get_figure()
fig.savefig("heat_map.png")

#### alert

In [234]:
task = 'посуда'
df_full = pd.read_csv('data.csv')
df = pd.DataFrame()
df['user']=df_full['user']
df['account_name']=df_full['account_name']
df['account_id']=df_full['account_id']
df[task]=df_full[task]
min_count = df[task].min()
actual_users = df[df[task]==min_count]
message_string = ''
for a_name in actual_users.account_name:
    message_string += a_name + ' '
message_string += task
message_string

'@IrinaYurasova @format37 посуда'

#### counter plus

In [235]:
df_full

      user    account_name  account_id  посуда  мусор  туалет
0    Ирина  @IrinaYurasova    38470768       0      1       1
1  Дмитрий      @format837    70753233       1      1       0
2  Алексей       @format37   106129214       0      0       1

In [260]:
task = 'посуда'
account_id = 106129214

df_full = pd.read_csv('data.csv')
current_value = int(df_full[df_full.account_id==account_id][task])
df_full.loc[(df_full.account_id==account_id),task]=current_value+1
df_full.to_csv('data.csv',index = None)
df_full

      user    account_name  account_id  посуда  мусор  туалет
0    Ирина  @IrinaYurasova    38470768       0      1       1
1  Дмитрий      @format837    70753233       1      1       0
2  Алексей       @format37   106129214       3      0       1

0

In [254]:
df_full

      user    account_name  account_id  посуда  мусор  туалет  task
0    Ирина  @IrinaYurasova    38470768       0      1       1   NaN
1  Дмитрий      @format837    70753233       1      1       0   NaN
2  Алексей       @format37   106129214       1      0       1   1.0